//
//  DataStore.swift
//  Radio_7
//
//  Created by Аня Беликова on 04.10.2023.
//

//import Foundation
//
//final class DataStore {
//
//    static let shared = DataStore()
//
//    let podcastTitle = [
//    "Говорим правильно",
//    "Прогулки со Смирновым"
//    ]
//
//    let podcastDate = [
//    "27.06.2023",
//    "24.06.2023"
//    ]
//
//    let podcastarticle = [
//    "Программа «Говорим правильно» - это совместный проект «Радио 7 на семи холмах» и портала Грамота.Ру о правилах в русском языке. Ведущий рубрики - кандидат филологических наук Владимир Пахомов в простой и легкой манере рассказывает о сложных и даже  курьезных случаях произношения слов.",
//    "В пятницу, субботу и воскресенье известный московский экскурсовод и знаток города на семи холмах Филипп Смирнов открывает для вас все секреты Москвы и предлагает отличные варианты для прогулок по городу!"
//    ]
//
//    private init() {}
//
//}
//
//
//extension DataStore {
//
//    static func getData(_ dataArr: [String]) -> String {
//        var dataArr: [String] = []
//
//        let data = "\(dataArr[Int.random(in: 0..<dataArr.count)])"
//
//        return data
//    }
//
//}
